GHB2/src/InformationRegisters/гхб_ОтветственныеЗаЛокации/гхб_ОтветственныеЗаЛокации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ОтветственныеЗаЛокации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ОтветственныйЗаЛокацию</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_СвойстваПомещений/гхб_СвойстваПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СвойстваПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСтроения</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПомещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДробнаяЧасть</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПомещения</name>
    <type>
      <types>CatalogRef.гхб_ТипыПомещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеКоличествоРабочихМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетРабочихМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточняющаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНаГенеральномПлане</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступВПомещениеПоКлючу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеОхраннойСигнализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомерКТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеКТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеДоступаСВысшимРуководителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщегоПользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ОтветственныеЗаЛокации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьОтветственногоЗаЛокацию(_Локация) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ОтветственныеЗаЛокацииСрезПоследних.ОтветственныйЗаЛокацию КАК ОтветственныйЗаЛокацию
	               |ИЗ
	               |	РегистрСведений.гхб_ОтветственныеЗаЛокации.СрезПоследних(, Локация = &Локация) КАК гхб_ОтветственныеЗаЛокацииСрезПоследних";
	
	Запрос.УстановитьПараметр("Локация", _Локация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ОтветственныйЗаЛокацию, Справочники.гхб_ФизическиеЛица.ПустаяСсылка());
	
КонецФункции

Функция ВернутьЛокацииПоОтветственному(_Ответственный) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ОтветственныеЗаЛокацииСрезПоследних.Локация КАК Локация
	               |ИЗ
	               |	РегистрСведений.гхб_ОтветственныеЗаЛокации.СрезПоследних(, ) КАК гхб_ОтветственныеЗаЛокацииСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
	               |		ПО гхб_ОтветственныеЗаЛокацииСрезПоследних.Локация = гхб_СвойстваПомещенийСрезПоследних.Помещение
	               |ГДЕ
	               |	гхб_ОтветственныеЗаЛокацииСрезПоследних.ОтветственныйЗаЛокацию = &ОтветственныйЗаЛокацию
	               |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("ОтветственныйЗаЛокацию", _Ответственный);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
